In [2]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas() 

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

In [3]:
df.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,NaN,NaN,NaN,Boehringer Ingelheim,NaN,NaN
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,NaN,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,NaN,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,NaN,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,NaN,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [4]:
df.tail()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,NaN,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,NaN,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,NaN,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,NaN,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,NaN,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [8]:
df.sample(10 , random_state=32)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
726955,Data Analyst,Data Analyst,"Atlanta, GA",via LinkedIn,Full-time,False,Georgia,2023-06-08 21:46:27,False,False,United States,NaN,NaN,NaN,Troutman Pepper,"['sql', 'python', 'r', 'sql server', 'azure', ...","{'analyst_tools': ['power bi', 'alteryx', 'exc..."
640874,Data Analyst,Market Data,"Kraków, Poland",via Trabajo.org,Full-time,False,Poland,2023-02-14 12:37:43,True,False,Poland,NaN,NaN,NaN,Grafton Recruitment Sp. z o.o.,"['c', 'linux']","{'os': ['linux'], 'programming': ['c']}"
133115,Business Analyst,Growth Analyst,Spain,via LinkedIn,Full-time,False,Spain,2023-07-14 08:22:56,True,False,Spain,NaN,NaN,NaN,Indicia Worldwide,"['html', 'css', 'javascript']","{'programming': ['html', 'css', 'javascript']}"
231903,Senior Data Scientist,"Senior Manager, Data Science","McLean, VA",via Trabajo.org,Full-time,False,"New York, United States",2023-10-25 07:03:26,False,False,United States,NaN,NaN,NaN,Cognosante,NaN,NaN
511218,Software Engineer,Re-advertisement: Senior Systems Analyst (24 M...,Saudi Arabia,via Jobs In South Africa,Full-time,False,Saudi Arabia,2023-06-27 11:42:23,False,False,Saudi Arabia,NaN,NaN,NaN,Rand Water,"['oracle', 'sap']","{'analyst_tools': ['sap'], 'cloud': ['oracle']}"
770498,Data Scientist,Data Scientist - Shuzhao Li,"Farmington, CT",via LinkedIn,Full-time,False,"New York, United States",2023-01-26 01:03:06,False,False,United States,NaN,NaN,NaN,The Jackson Laboratory,"['python', 'r']","{'programming': ['python', 'r']}"
408161,Data Engineer,Cloud Data Engineer,India,via BeBee India,Full-time,False,India,2023-05-16 16:17:10,False,False,India,NaN,NaN,NaN,Ericsson,"['shell', 'scala', 'python', 'java', 'airflow'...","{'libraries': ['airflow', 'pyspark', 'spark', ..."
61685,Software Engineer,IT Engineer,"Bogotá, Bogota, Colombia",via BeBee,Full-time,False,Colombia,2023-08-23 06:28:09,True,False,Colombia,NaN,NaN,NaN,jobandtalent,"['sql', 'go', 'mysql', 'oracle']","{'cloud': ['oracle'], 'databases': ['mysql'], ..."
496542,Business Analyst,Analist indicatoren,"Brussels, Belgium",via BeBee Belgique,Full-time,False,Belgium,2023-10-09 11:50:37,False,False,Belgium,NaN,NaN,NaN,Actiris,NaN,NaN
1856,Data Scientist,Data Scientist III - Product Lifecycle & Inter...,"Barcelona, Spain",via LinkedIn,Full-time,False,Spain,2023-03-07 13:44:13,False,False,Spain,NaN,NaN,NaN,Teladoc Health,"['python', 'sql', 'pytorch', 'tensorflow', 'sp...","{'libraries': ['pytorch', 'tensorflow', 'spark..."

In [9]:
df_original = dataset['train'].to_pandas()

In [10]:
df_altered = df_original

In [14]:
median_salary = df_original['salary_year_avg'].median()

median_salary

np.float64(115000.0)

In [15]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

In [17]:
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [18]:
df_original.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [20]:
#so we can see that by altering altered df only. original one also got changed
# it means df_altered = df_original will not create a exact copy

# check by using id
id(df_original) == id(df_altered)

True

In [25]:
# so use copy
df_original = dataset['train'].to_pandas()
df_altered = df_original.copy()

id(df_altered) == id(df_original)

False

In [26]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

In [27]:
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [28]:
df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64